04_CFD/pipeline/sweep_run/cases/d-10p0_M0p200_aoa-4p0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      2;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ( forces );
        patches         ( mainfoil flap );
        rho             rhoInf;
        rhoInf          1;
        liftDir         ( 0.069756 0.997564 0 );
        dragDir         ( 0.997564 -0.069756 0 );
        CofR            ( 0.25 0 0 );
        pitchAxis       ( 0 0 1 );
        magUInf         68.06;
        lRef            1;
        Aref            0.1;
        writeControl    timeStep;
        writeInterval   1;
        log             true;
    }
    hingeMoment1
    {
        type            forceCoeffs;
        libs            ( forces );
        patches         ( flap );
        rho             rhoInf;
        rhoInf          1;
        liftDir         ( 0.069756 0.997564 0 );
        dragDir         ( 0.997564 -0.069756 0 );
        CofR            ( 0.7 0 0 );
        pitchAxis       ( 0 0 1 );
        magUInf         68.06;
        lRef            1;
        Aref            0.1;
        writeControl    timeStep;
        writeInterval   1;
        log             true;
    }
}


// ************************************************************************* //
