04_CFD/pipeline/sweep_run/cases/d-10p0_M0p200_aoa-4p0/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    mainfoil
    {
        // se adapta automáticamente si el y+ real queda algo distinto de 1
        // (por ejemplo en las condiciones de menor Re del barrido)
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    flap
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }

    farfield
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
